## Итоговая контрольная работа по основному блоку
#### Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
#
#### Программа запрашивает ввод исходного массива строк с клавиатуры, разделенных запятыми. Затем она создает новый массив строк, перебирает все элементы исходного массива и добавляет те, длина которых не превышает 3 символов, в новый массив. Затем размер нового массива уменьшается до количества найденных элементов. Результат выводится на экран.
[Ссылка на блок-схему](/DiagramToTheProgram v.2.pdf)
#

##### Вводим с клавиатуры массив строк
        Console.WriteLine("Введите исходный массив строк, разделяя элементы запятой:");
        string[] inputArray = Console.ReadLine()!.Split(',');

##### Создаем новый массив строк
        int count = 0;
        string[] newArray = new string[inputArray.Length];

        for (int i = 0; i < inputArray.Length; i++)
        {
            string trimmed = inputArray[i].Trim();
            if (trimmed.Length <= 3)
            {
                newArray[count] = trimmed;
                count++;
            }
        }

##### Уменьшаем размер массива до количества найденных элементов с длиной строки 3 или меньше символов
        Array.Resize(ref output, count);

##### Выводим результат в консоль
        Console.Write("Результат: ");
        for (int i = 0; i < count; i++)
        {
            Console.Write(newArray[i] + " ");
        }

#
