## Итоговая контрольная работа по основному блоку
#### Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
#
#### Программа запрашивает ввод исходного массива строк с клавиатуры, разделенных запятыми. Затем она создает новый массив строк, перебирает все элементы исходного массива и добавляет те, длина которых не превышает 3 символов, в новый массив. Затем размер нового массива уменьшается до количества найденных элементов. Результат выводится на экран.
[Ссылка на блок-схему](/DiagramToTheProgram.pdf)
#

##### Вводим с клавиатуры массив строк
        Console.WriteLine("Введите исходный массив строк, разделяя элементы запятыми:");
        string[] input = Console.ReadLine().Split(',');

##### Создаем новый массив строк
        int count = 0;
        string[] output = new string[input.Length];
        for (int i = 0; i < input.Length; i++)
        {
            if (input[i].Length <= 4)
            {
                output[count] = input[i];
                count++;
            }
        }

##### Уменьшаем размер массива до количества найденных элементов с длиной строки 3 или меньше символов
        Array.Resize(ref output, count);

##### Выводим результат в консоль
        Console.WriteLine("Результат:");
            foreach (string s in output)
            {
                Console.WriteLine(s);
            }

#